[
    {
        "name":"Jackson 'Jax' Teller",
        "description":"is the son of Gemma and John Teller; born in 1978, he was raised in the rural fictional Northern California town of Charming. His father, founder and first President of the Sons of Anarchy Motorcycle Club, died in a road accident in 1993; his mother Gemma marries club member Clay Morrow, who then became President of the club's 'Redwood Original' charter. As the show begins, Jax serves as his charter's Vice President, and works as a mechanic at the family automotive repair shop. He has served time in prison for smuggling and gun-running related to the club's activities, and is estranged from his pregnant wife Wendy; as the series begins, she overdoses and endangers the life of their unborn son Abel, who is born addicted to methamphetamine. Jax has also discovered a manuscript by his late father, in which John describes his disillusionment with the club.",
        "image_source":"https://static.wikia.nocookie.net/sonsofanarchy/images/0/03/Jax_706.png",
        "url":"jackson"
    },
    {
        "name":"Gemma Teller Morrow",
        "description":"Gemma was born September 15, 1957 to Nate and Rose and is a native of Charming, California; her maiden name is Madock. According to Sheriff Wayne Unser, she left Charming when she was sixteen and returned 'ten years later with a baby and a motorcycle club'. She married John Teller, a Vietnam War veteran and founder of the Sons of Anarchy Motorcycle Club, with whom she had two children: Jackson in 1978 and Thomas in 1984. Gemma has a scar on her chest which is explained when her grandson Abel has surgery. Gemma has a genetic heart disorder from her mother's side which she passed on to her children—Thomas died in 1990 from complications of the disorder, and Abel nearly died from heart complications after his premature birth. After John was hit by a semi-truck and died in 1993, she quickly married John's friend Clay Morrow.",
        "image_source":"https://static.wikia.nocookie.net/sonsofanarchy/images/3/3e/GemmaTellerMorrow.jpg",
        "url":"gemma"
    },
    {
        "name":"Clarence 'Clay' Morrow",
        "description":"Clay initially appeared as a main character and protagonist in the first three seasons, gradually became the primary antagonist of Season 4, the secondary antagonist of Season 5 and a secondary antagonist-turned-anti-hero of Season 6.",
        "image_source":"https://static.wikia.nocookie.net/sonsofanarchy/images/1/14/Clay_511.jpg",
        "url":"clarence"
    },
    {
        "name":"Harry 'Opie' Winston",
        "description":"was a member of the Sons of Anarchy MC on the FX original series Sons of Anarchy. Played by American actor Ryan Hurst, Opie makes his debut in the series' premiere episode, 'Pilot', in the series' first season. He plays a recurring role through the series' first, second, third, fourth, and fifth seasons before his murder.",
        "image_source":"https://static.wikia.nocookie.net/sonsofanarchy/images/2/24/Opie_411.jpg",
        "url":"harry"
    },
    {
        "name":"Chief Wayne Unser",
        "description":"A corrupt cop who sees the Sons of Anarchy Motorcycle Club as a benefit to the town due to them successfully keeping drugs and violence out of Charming, California, the club helps protect the population from many other unwanted things, like ruthless developers, such as Deputy Hale's older brother Jacob Hale Jr..",
        "image_source":"https://static.wikia.nocookie.net/sonsofanarchy/images/8/8d/Unser_702.png",
        "url":"wayne"
    },
    {
        "name":"Alexander 'Tig' Trager",
        "description":"is the current Vice President and former Sergeant-at-Arms of the Sons of Anarchy Motorcycle Club Redwood Original (SAMCRO).",
        "image_source":"https://static.wikia.nocookie.net/sonsofanarchy/images/c/c4/Tig_709.png",
        "url":"alexander"
    }
]